Repository: aegoroff/hc
Catalog: src/hc/po/*.po
Languages: ru

source: Unknown hash: %s
ru: Неизвестный хэш: %s

source: --sfv option doesn't support %s algorithm. Only crc32 or crc32c supported
ru: опция --sfv не подерживается в алгоритме %s. Применимо только для crc32 или crc32c

source: set the limit in bytes of the part of the file to calculate hash for. The whole file by default will be applied
ru: количество байт файла для вычисления хэша. По умолчанию будет использоваться весь файл

source: set start position within file to calculate hash from. Zero by default
ru: стартовая позиция в файле для вычисления хэша. По умолчанию начало файла

source: print this help and exit
ru: показать помощь и выйти

source: show calculation time (false by default)
ru: показывать время вычислений (по умолчанию нет)

source: output hash using low case (false by default)
ru: выход хэша с использованием нижнего регистра (по умолчанию в верхнем)

source: output hash in file checksum format
ru: вывод формате файла контрольной суммы

source: output hash in the SFV (Simple File Verification) format (false by default). Only for CRC32 or CRC32C.
ru: выводить в виде SFV (Simple File Verification). Только для CRC32 или CRC32C. По умолчанию нет.

source: Disable hash crack time probing (how much time it may take)
ru: Отключить оценку времени восстановления строки (сколько примерно это может занять)

source: Disable error output while search files. False by default.
ru: Отключить вывод ошибок во время поиска файлов. По умолчанию выводить.

source: the number of threads to crack hash. The half of system processors by default. The value must be between 1 and processor count.
ru: количество потоков, чтобы взломать хэш. Половина количества процессоров системы по умолчанию. Значение должно быть между 1 и числом равным количеству процессоров.

source: save files' hashes into the file specified instead of console.
ru: сохранение хэшей файлов в указанный файл, вместо консоли.

source: hash algorithm. See all possible values below
ru: хэш алгоритм. См. возможные значения ниже

source: output hash as Base64
ru: выводить хэш в base64

source: must be string
ru: должно быть string

source: must be hash
ru: должно быть hash

source: must be file
ru: должно быть file

source: must be dir
ru: должно быть dir

source: string to calculate hash sum for
ru: строка для которой вычисляется хэш

source: hash to restore initial string by
ru: хэш по которому будет восстанавливаться строка

source: full path to file to calculate hash sum of
ru: полный путь к файлу для вычисления хэш-суммы

source: full path to dir to calculate all content's hashes
ru: полный путь к каталогу для вычисления хэша всех его файлов

source: exclude files that match the pattern specified. It's possible to use several patterns separated by ;
ru: исключать файлы удовлетворяющие заданному шаблону. Возможно указывать несколько шаблонов, разделяя их ;

source: include only files that match the pattern specified. It's possible to use several patterns separated by ;
ru: использовать только те файлы, что удовлетворяют заданному шаблону. Возможно указывать несколько шаблонов, разделяя их ;

source: hash to validate file
ru: хэш для проверки файла

source: hash to validate files in directory
ru: хэш для проверки файлов в каталоге

source: interpret hash as Base64
ru: хэш задан в форме base64

source: initial string's dictionary. All digits, upper and lower case latin symbols by default. Specify value ASCII here to use all ASCII charset as dictionary
ru: словарь строки. Все цифры, латинские буквы в верхнем и нижнем регистре по умолчанию. Укажите значение ASCII чтобы использовать весь набор ASCII как словарь

source: set minimum length of the string to restore. 1 by default
ru: минимальная длина строки для восстановления. По умолчанию 1

source: set maximum length of the string to restore. 10 by default
ru: максимальная длина строки для восстановления. По умолчанию 10

source: hash to search a file that matches it
ru: хэш для поиска файла который ему соответствует

source: scan directory recursively
ru: включая вложенные каталоги

source: test performance by cracking 12345 string hash
ru: тест производительности путем восстановления хэша строки 12345

source: Invalid command one of: %s, %s, %s or %s expected
ru: Неверная команда ожидается одна из: %s, %s, %s or %s

source: Threads number must be between 1 and %u but it was set to %lu. Reset to default %u
ru: Количество потоков должно быть между 1 и %u но было задано %lu. Используется значение %u

source: Invalid %s option must be positive but was %lli
ru: Ошибка параметр %s должен быть положительным но был %lli

source: Error opening file: %s Error message:
ru: Ошибка открытия файла: %s Сообщение об ошибке:

source: Supported hash algorithms:
ru: Поддерживаемые хэш алгоритмы:

source: Empty string
ru: Пустая строка

source: May take approximatelly: %s (%s attempts)
ru: Может занять примерно: %s (%s попыток)

source: Initial string is: %s
ru: Исходная строка: %s

source: Nothing found
ru: Ничего не найдено

source: Attempts: %s Time
ru: Попыток: %s Время

source: Speed: %s attempts/second
ru: Скорость: %s попыток в секунду

source: Max string length is too big: %lu
ru: Максимальная длина строки слишком велика: %lu

source: File is valid
ru: Файл верный

source: File is invalid
ru: Файл неверный

source: Offset is greater then file size
ru: Смещение больше чем размер файла
